# Pandas

In [3]:
import pandas as pd
s1 = pd.Series({'Name':'John',
                'Item': 'Beer',
                'Cost': 2.75})
s2 = pd.Series({'Name':'Craig',
                'Item': 'Chips',
                'Cost': 5.75})
s3 = pd.Series({'Name':'Fred',
                'Item': 'Cones',
                'Cost': 1.75})

In [5]:
df = pd.DataFrame([s1,s2,s3], index=['Store1','Store2','Store1'])

In [6]:
df2 = pd.DataFrame([s1,s2,s3])

In [7]:
df

        Cost   Item   Name
Store1  2.75   Beer   John
Store2  5.75  Chips  Craig
Store1  1.75  Cones   Fred

In [8]:
df2

   Cost   Item   Name
0  2.75   Beer   John
1  5.75  Chips  Craig
2  1.75  Cones   Fred

In [9]:
df3 = pd.DataFrame([s1,s2,s3], index=[3,4,5])

In [10]:
df3

   Cost   Item   Name
3  2.75   Beer   John
4  5.75  Chips  Craig
5  1.75  Cones   Fred

In [16]:
df4 = pd.DataFrame([{'Fork': False}, {'Tum': True}, {'Fork': True}],
                   index=['a','b','c'])
df4

    Fork   Tum
a  False   NaN
b    NaN  True
c   True   NaN

In [30]:
df3['Cost'] = df3['Cost'] * 2
df3

   Cost   Item   Name
3  11.0   Beer   John
4  23.0  Chips  Craig
5   7.0  Cones   Fred

In [31]:
df3.T

         3      4      5
Cost    11     23      7
Item  Beer  Chips  Cones
Name  John  Craig   Fred

In [33]:
df3.iloc[0]

Cost      11
Item    Beer
Name    John
Name: 3, dtype: object

In [34]:
df.loc['Store1']['Cost']

Store1    2.75
Store1    1.75
Name: Cost, dtype: float64

In [35]:
df.loc[:,['Name','Cost']]

         Name  Cost
Store1   John  2.75
Store2  Craig  5.75
Store1   Fred  1.75

In [40]:
df.loc[:,['Name','Item']]

         Name   Item
Store1   John   Beer
Store2  Craig  Chips
Store1   Fred  Cones

In [44]:
copied = df3.drop(3)

In [45]:
copied

   Cost   Item   Name
4  23.0  Chips  Craig
5   7.0  Cones   Fred

In [69]:
copied = df3.copy()
#copied.drop('Item', inplace=True, axis=1)

In [70]:
del copied['Item']
copied

   Cost   Name
3  11.0   John
4  23.0  Craig
5   7.0   Fred